app/controllers/spotify_tracks_controller.rb

SELECT * FROM "spotify_tracks" WHERE ("spotify_tracks"."spotify_id" = '3PWam8KG2bbpdfzzdidEY9') LIMIT 1
---
  def index
    @spotify_tracks = SpotifyTrack.all