app/controllers/spotify_artists_controller.rb

SELECT * FROM "spotify_artists"
---
  def index
    @spotify_artists = SpotifyArtist.all